export const purpleColor = {
  '01': '#F8FAFF',
  '02': '#DAE2FF',
  '03': '#BBCBFF',
  '04': '#A9B8EC',
  '05': '#94A3D7',
  '06': '#5F6B8C',
  '07': '#434C6C',
  '08': '#3A4052',
}

export const blueColor = {
  '01': '#F7FAFC', // 非常淺的藍白
  '02': '#E3EBF3', // 淡霧藍
  '03': '#C8D6E4', // 淺灰藍
  '04': '#A6BDD2', // 柔和藍
  '05': '#86A5BF', // 中亮灰藍
  '06': '#6688A3', // 稍暗湖藍
  '07': '#4B6880', // 深湖藍
  '08': '#344A59', // 深藍灰
};



export const greenColor = {
  '01': '#F6FBF9', // 淺白綠
  '02': '#E4F3EE', // 淡霧綠
  '03': '#C8E4D9', // 柔和綠
  '04': '#A2CDBF', // 淺青綠
  '05': '#80B5A6', // 中灰綠
  '06': '#5E9588', // 暗灰綠
  '07': '#437064', // 深青灰
  '08': '#2E4D45', // 深綠灰
};

export const pinkColor = {
  '01': '#FFF8F9', // 非常淺粉白
  '02': '#FDE4E6', // 淡霧粉
  '03': '#F7CCD0', // 柔粉
  '04': '#E6A4AB', // 溫暖粉
  '05': '#D1848C', // 中粉
  '06': '#B96B73', // 暗粉
  '07': '#8F5056', // 深粉棕
  '08': '#66373C', // 暗紅棕
};

export const yellowColor = {
  '01': '#FFFBF2',
  '02': '#FFF0CD',
  '03': '#FFE5A7',
  '04': '#F6D27E',
  '05': '#DBB763',
  '06': '#88713B',
  '07': '#69562D',
  '08': '#4A3E20',
}

export const orangeColor = {
  '01': '#FFF8F3', // 非常淺橘白
  '02': '#FDECDC', // 淡霧橘
  '03': '#F8D4BA', // 柔和橘
  '04': '#F2B08B', // 溫暖橘
  '05': '#E69369', // 中橘
  '06': '#C9734F', // 暗橘
  '07': '#9C523A', // 深橘棕
  '08': '#6F3828', // 暗棕橘
};

export const grayColor = {
  '01': '#FFFFFF',
  '02': '#FAFAFA',
  '03': '#F0F0F0',
  '04': '#BFBFBF',
  '05': '#999999',
  '06': '#666666',
  '07': '#333333',
  '08': '#000000',
}
